# Я хочу создать игру в которой сверху будут падать подарки а пользователю нужно будет их собирать управляя носком.
# Можно сделать уровни чтобы подарки становились меньше и падали быстрее. Предварительное назание - 'Ловец подарков'
# В программе нужно будет реализовать:
# 1)	класс Christmas_sock, который будет отвечать за прорисовку новогоднего "носка-ловца" и его перемещение на экране
# 2)	класс Gifts, отвечающий за создание, размещение и перемещение на экране подарков.
# 3)	также будет бесконечный цикл который будет обрабатывать действия пользователя - нажатия кнопок и вызывать методы
# классов.
# Программа будет делать:
# 1)	Размещать носок для ловли подарков.
# 2)	Обрабатывать действия пользователя(нажатия кнопок).
# 3)	Перемещать подарки и носок по экрану, обработать случай когда носок и подарок пересекутся.
